

|   | Runde | 0 | 1 | 2 | Resultat |          % |
|---+-------+---+---+---+----------+------------|
| ! | name  |   |   |   |   result | percentage |
| # | Alice | 1 | 1 | 0 |        2 |      66.67 |
| # | Bob   | 0 | 0 | 1 |        1 |      33.33 |
#+TBLFM: $6='(+ $<<<..$>>>);N
#+TBLFM: $7='(format "%2.2f" (* (/ 100 (float (+ @3$result @4$result))) $result));N
#+TBLFM: $result='(+ $<<<..$>>>);N
#+TBLFM: $percentage='(format "%2.2f" (* (/ 100 (float (+ @3$result @4$result))) $result));N



|---+---------+--------+--------+--------+-------+------|
|   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
|---+---------+--------+--------+--------+-------+------|
| ! |         |     P1 |     P2 |     P3 |   Tot |      |
| # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
| ^ |         |     m1 |     m2 |     m3 |    mt |      |
|---+---------+--------+--------+--------+-------+------|
| # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
| # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
|---+---------+--------+--------+--------+-------+------|
|   | Average |        |        |        |  25.0 |      |
| ^ |         |        |        |        |    at |      |
| $ | max=50  |        |        |        |       |      |
|---+---------+--------+--------+--------+-------+------|
#+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@-II..@-I);%.1f


| ! | C1 | C2 | Tot |   |
|---+----+----+-----+---|
| * |  1 |  3 |   4 |   |
| * |  2 |  4 |   6 |   |
#+TBLFM: $4=vsum($C1..$C2)



| ! | C1 | C2 | Tot |       |
|---+----+----+-----+-------|
| # |  1 |  3 |   4 |     1 |
| # |  2 |  4 |   6 |     2 |
|---+----+----+-----+-------|
| # |    |    |     |   3.0 |
| ^ |    |    |     | stuff |
#+TBLFM: $5=$C1::$stuff=@2$C2;%.1f

| _ |   |   | A1 | A2 |
| # | 4 | 4 | 24 | 25 |
| # | 4 | 4 | 34 | 35 |
| ^ |   |   | B1 | B2 |
#+TBLFM: @2$<<..@3$<<<=4::$A1=@#$#::$A2=@#$#::$B1=@#$#::$B2=@#$#



| ! | C1 | C2 |    |    |
| _ |    |    | A1 | A2 |
| # |  4 |  4 |  4 |  4 |
| # |  4 |  4 |    |    |
#+TBLFM: @3$<<..@4$<<<=4::$A1=$C1::$A2=$C2




| ! | C1 | C2 |        |        |
| # | a  | a  |        |        |
| # | b  | b  |        |        |
| _ |    |    | A1     | A2     |
| # |    |    | [a, b] | [a, b] |
#+TBLFM: @2$2=a::@3$2=b::@2$3=a::@3$3=b::$A1=@<<$C1..@>>$C1::$A2=@<<$C2..@>>$C2



| ! | C1 | C2 |           |        |
| # | A  | c  | [A (, b)] |        |
| # | b  | d  |           |        |
| _ |    |    | A1        | A2     |
| # |    |    | [A, b]    | [a, b] |
#+TBLFM: @2$2=A::@2$3=c::@2$4='(identity $A1 )::@3$2=b::@3$3=d::$A1=@<<$C1..@>>$C1::A2=@<<$C2..@>>$C2




| ! | C1 | C2 |           |        |
| # | A  | c  | [A (, B)] |        |
| # | B  | d  |           |        |
| _ |    |    | A1        | A2     |
| # |    |    | [A, B]    | [a, b] |
#+TBLFM: @2$2=A::@2$3=c::@2$4='(identity $A1 )::@3$2=B::@3$3=d::$A1=@<<$C1..@>>$C1::A2=@<<$C2..@>>$C2




| ! | C1 | C2 |        |           |
| # | A  | C  | A      | [C (, d)] |
| # | B  | d  | A      |           |
| _ |    |    | A1     | A2        |
| # |    |    | [A, B] | [C, d]    |
#+TBLFM: @2$2=A::@2$3=C::@2$4..@3$4='(elt $A1 0);L::@2$5='(identity $A2)::@3$2=B::@3$3=d::$A1=@<<$C1..@>>$C1::$A2=@<<$C2..@>>$C2;L




| ! | C1     | C2     |   |           |
| # | A      | C      | A | [C (, D)] |
| # | B      | D      | A |           |
| _ | A1     | A2     |   |           |
| # | [A, B] | [C, D] |   |           |
#+TBLFM: @2$2=A::@2$3=C::@2$4..@3$4='(elt $A1 0)::@2$5='(identity $A2);L::@3$2=B::@3$3=D::$A1=@<<$C1..@>>>$C1::$A2=@<<$C2..@>>>$C2

* Junk

| ! | C1    | C2    |   |       |
| # | A     | C     | A | [C D] |
| # | B     | D     | B | [C D] |
| _ | A1    | A2    |   |       |
| / | [A B] | [C D] |   |       |
#+TBLFM: @2$2=A::@2$3=C::@2$4..@3$4='(elt $A1 (- @# 2))::@2$5..@3$5='(identity $A2)::@3$2=B::@3$3=D::$A1='(vector @2$$#..@3$$#)::$A2='(vector @2$$#..@3$$#)



| ! | C1    | C2    |   |   |
| # | A     | C     | A | C |
| # | B     | D     | B | D |
| _ | A1    | A2    |   |   |
| / | [A B] | [C D] |   |   |
#+TBLFM: @2$2=A::@2$3=C::@2$4..@3$4='(elt $A1 (- @# 2))::@2$5..@3$5='(elt $A2 (- @# 2))::@3$2=B::@3$3=D::$A1='(vector @2$$#..@3$$#)::$A2='(vector @2$$#..@3$$#)




| ! | C1    | C2    |   |   |
| # | A     | C     | A | C |
| # | B     | D     | B | D |
| _ | A1    | A2    |   |   |
| / | [A B] | [C D] |   |   |
#+TBLFM: @2$2=A::@2$3=C::@2$4..@3$4='(elt $A1 (- @# 2))::@2$5..@3$5='(elt $A2 (- @# 2))::@3$2=B::@3$3=D::$A1='(vector @2$C1..@3$C1)::$A2='(vector @2$C2..@3$C2)



| ! | C1    | C2    |   |   |
| # | A     | C     | A | C |
| # | B     | D     | B | D |
| _ | A1    | A2    |   |   |
| / | [A B] | [C D] |   |   |
#+TBLFM: @2$2=A::@2$3=C::@2$4..@3$4='(elt $A1 (- @# 2))::@2$5..@3$5='(elt $A2 (- @# 2))::@3$2=B::@3$3=D::$A1='(vector @2$C1..@3$C1)::$A2='(vector @2$C2..@3$C2)



| ! | C1    | C2    |
| / | a     | C     |
| / | B     | D     |
| _ | A1    | A2    |
| / | [a B] | [C D] |
|   |       |       |
#+TBLFM: $2=@1$1::@2$2=a::@2$3=C::@3$2=B::@3$3=D::@4$2..@4$3='(format "A%i" (- $# 1))::$A1='(vector @2$C1..@3$C1)::$A2='(vector @2$C2..@3$C2)

A1='(vector @2$C1..@3$C1)::A2='(vector @2$C2..@3$C2)


| _ | C1 | C2 |
| / |  1 |  2 |
| / |    |    |
#+TBLFM: $C1='(- $# 1)::$C2='(- $# 1)

| # | Bob   |       0 |  0 |  1 | 1        | 33.33      |


|   | Runde |    0 |    1 |    2 | Resultat | %          |
|---+-------+------+------+------+----------+------------|
| ! |       |   c0 |   c1 |   c2 |          |            |
| _ | name  |      |      |      | result   | percentage |
| # | Alice |    1 |    1 |    0 | 2        | 66.67      |
#+TBLFM: $result='(reduce '+ (vector $c0..$c2));N::$percentage='(calc-eval (format "(%i/%i)*100" $result (length (vector $c0..$c2))));%2.2f

# (length (vector $c0..$c2))

#+BEGIN_SRC elisp
(calc-eval (format "(%i/%i)*100" 2 (length (vector 1 1 0 0))))
#+END_SRC

#+RESULTS:
: 50.
